# 一、处理缺失数据

In [1]:
#导包
import numpy as np
import pandas as pd 
import matplotlib as plt

In [2]:
#pandas使用浮点值NaN（Not a Number）表示缺失数据
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
#（1）
#判断是否为空isnull()
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

一些关于缺失值数据处理的函数  
- dropna：根据标签中的值是否存在缺失数据对轴标签进行过滤，可通过阈值调节对缺失值的容忍度；
- fillna：用指定值或插值方法(如ffill或bfill)填充缺失数据；
- notnull：isnull的否定式；

***

## 滤除缺失值（dropna）

In [4]:
#Series
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])  
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [5]:
#DataFrame
#你可能希望丢弃全NA或含有NA的行或列,dropna默认丢弃任何含有缺失值的行
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [6]:
#过滤后
cleaned

     0    1    2
0  1.0  6.5  3.0

In [7]:
#传入how='all'将只丢弃全为NA的那些行(即将第2行删除)
data.dropna(how='all')
#若要对列操作，则只需传入axis=1即可
#data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

***

## 填充缺失值（fillna）

In [8]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0  0.641034       NaN       NaN
1 -0.286910       NaN       NaN
2  1.047677       NaN  0.170273
3  0.067153       NaN  0.519215
4 -0.703446 -0.674641 -0.487431
5  0.139976 -1.086426 -0.912802
6 -0.695141 -0.640819 -0.308420

In [9]:
#自动填充（行列都填充）
df.fillna(123)

          0           1           2
0  0.641034  123.000000  123.000000
1 -0.286910  123.000000  123.000000
2  1.047677  123.000000    0.170273
3  0.067153  123.000000    0.519215
4 -0.703446   -0.674641   -0.487431
5  0.139976   -1.086426   -0.912802
6 -0.695141   -0.640819   -0.308420

In [10]:
#填充列
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.641034  0.500000  0.000000
1 -0.286910  0.500000  0.000000
2  1.047677  0.500000  0.170273
3  0.067153  0.500000  0.519215
4 -0.703446 -0.674641 -0.487431
5  0.139976 -1.086426 -0.912802
6 -0.695141 -0.640819 -0.308420

***

# 二、数据转换

## 移除重复的数据（duplicated、drop_duplicates）

In [15]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [17]:
#duplicated方法
#返回一个布尔型Series，表示各行是否是重复行
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [18]:
#drop_duplicates方法
#它会返回一个DataFrame，重复的数组会标为False
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [20]:
#移除指定列的重复值
data.drop_duplicates(['k2'])

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [21]:
#默认是保留第一次出现的，可以改成保留最后一次出现的
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

***

## 利用函数或映射进行数据转换

In [22]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                    'Pastrami', 'corned beef', 'Bacon',
                    'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [24]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}
#因为meat_to_animal中的key是小写的，所以要将food小写
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [25]:
#利用map将其对应
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

***

## 替换值（replace）

In [26]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [27]:
#将-999替换成NaN
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [28]:
#将数组替换成NaN
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [29]:
#也可以每个值替换不同的值
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [30]:
#传入的参数也可以是字典
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

***

## 离散化和面元划分（cut）

为了便于分析，连续数据常常被离散化或拆分为“面元”（bin）。假设有一组人员数据，而你希望将它们划分为不同的年龄组。

In [31]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

接下来将这些数据划分为“18到25”、“26到35”、“35到60”以及“60以上”几个面元。要实现该功能，你需要使用pandas的cut函数。

In [33]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats
#说明：20在(18,25]之内

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [34]:
#面元计数value_counts
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [35]:
#修改区间闭端right=False进行修改
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

***

## 检测和过滤异常值

In [36]:
#过滤或变换异常值（outlier）在很大程度上就是运用数组运算。
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()
#描述

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.039214     0.041254     0.001398     0.003753
std       0.997905     0.988206     0.991378     0.936174
min      -3.619935    -2.901557    -2.969546    -2.879871
25%      -0.620781    -0.639800    -0.650233    -0.625020
50%       0.052243     0.038324    -0.009731     0.011322
75%       0.726969     0.748599     0.681930     0.609202
max       3.903828     2.777870     3.093880     2.591495

In [37]:
#找出某列中绝对值大小超过3的值
col = data[2]
col[np.abs(col) > 3]

466    3.09388
Name: 2, dtype: float64

In [42]:
#选出全部含有“超过3或－3的值”的行，any方法
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
195 -3.619935  0.026163 -0.418008 -1.055544
298 -3.038615 -1.098150 -1.955402 -0.334771
466  1.530967  2.777870  3.093880 -0.107898
698 -3.006470 -0.595911  0.377948 -0.425560
743  3.045129 -0.073891 -0.525048  0.220540
797  3.903828 -0.877699  0.162361 -0.446779
823 -3.377280 -0.160302 -0.955520 -0.193983